{
  "backend/main.mo": "Motoko canister defining Sector and Product types, seeding initial data, and exposing query functions for listing, filtering, and searching products and sectors.",
  "feature_evidence.json": "Feature evidence report listing implemented features, associated source files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of multiple frontend files and components for reference.",
  "frontend/index.css": "Tailwind base and theme variable definitions for light and dark modes with custom color tokens and background behavior.",
  "frontend/index.html": "Basic HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps pages in SiteLayout and RouteTransition.",
  "frontend/src/components/catalog/ProductCard.tsx": "Reusable product card displaying product details, advantages, disadvantages, and link to the product page.",
  "frontend/src/components/motion/Magnetic.tsx": "Component applying magnetic hover movement based on cursor position with reduced-motion support.",
  "frontend/src/components/motion/RouteTransition.tsx": "Wraps children in a div that animates opacity and vertical position on route changes using router subscriptions.",
  "frontend/src/components/motion/useInertialScroll.ts": "Hook enabling smooth scrolling unless reduced-motion is preferred, restoring defaults on cleanup.",
  "frontend/src/components/portfolio/BiographyScrollytelling.tsx": "Scroll-driven biography section that animates titles and content visibility based on scroll progress.",
  "frontend/src/components/portfolio/Hero3D.tsx": "Renders an interactive Three.js particle sphere with a fallback for low-performance devices.",
  "frontend/src/components/portfolio/MediaPortraits.tsx": "Displays a responsive grid of portrait images with hover scaling and gradient overlay effects.",
  "frontend/src/components/portfolio/PortfolioVideoGallery.tsx": "Shows a grid of video cards with playable videos, hover overlay, and titles.",
  "frontend/src/components/portfolio/SkillsHubBento.tsx": "Presents a grid of skill cards with icons, colors, and hover animations.",
  "frontend/src/components/portfolio/useHeroPerformanceMode.ts": "Determines whether to render full 3D hero based on motion preference, device type, and hardware concurrency.",
  "frontend/src/components/portfolio/useScrollProgress.ts": "Hook computing scroll progress of an element using its viewport position and requestAnimationFrame.",
  "frontend/src/components/SiteLayout.tsx": "Defines the global layout with cyber background, sticky glass header, navigation links, and mobile menu.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useCatalog.ts": "Provides React Query hooks for fetching sectors and products from the backend actor with various filters.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements a React context and provider for Internet Identity authentication using AuthClient, exposing identity state and login/logout helpers.",
  "frontend/src/index.css": "Defines global Tailwind layers, theme variables for light/dark modes, glassmorphism utilities, and base typography and layout styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/AboutContactPage.tsx": "Renders an about and contact page with media sections, mission, expertise, and detailed contact cards.",
  "frontend/src/pages/HomePage.tsx": "Displays the homepage with a 3D hero section, biography scrollytelling, skills showcase, and featured products and sectors.",
  "frontend/src/pages/ProductDetailPage.tsx": "Shows detailed product information including pricing, advantages, disadvantages, and related sector, with loading and not-found states.",
  "frontend/src/pages/SectorPage.tsx": "React page that loads a sector by ID, filters products by search term, and displays results with loading skeletons and product cards.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme colors, typography, container settings, animations, and plugin usage.",
  "project_state.json": "Project metadata describing the portfolio site's vision, features, architecture notes, and requirement mappings."
}